#include<iostream>

//Создание структуры.
struct Point
{
	//Структура Point описывает точки на плоскости.
	double x; //Координата по X
	double y; //Координата по Y
};
//	Создовая структуру или класс, мы создаём новый тип данных.
//	А обяъявляя объекты этого класса или структуры - мы создаём переменные нашего типа.

//Классы и структуры ещё называют пользовательскими типами данных.

//	Класс		- это тип данных.
//	Структура	- это тип данных.
//	Объект		- это обычная переменная.

void main()
{
	setlocale(LC_ALL, "Russian");
	int a;		//Объявление переменной 'a' типа 'int'
	Point A;	//Оюъявление (Создание) объекта 'A'  структуры 'Point'.
				//Объявление переменной 'A' типа  'Point'
}